In [1]:
from sqlalchemy import create_engine
import pymysql
import boto3

# Make new DB on server

In [2]:
# MySQL server details
host = 'XXX'
user = 'XXX'
password = 'XXX'
port=3306

In [3]:
# Connect to server
connection = pymysql.connect(host=host, user='admin', password=password, port=port)

# Make a new DB
new_database_name='MADAIR'

try:
    with connection.cursor() as cursor:
        cursor.execute(f"CREATE DATABASE IF NOT EXISTS {new_database_name};")
        print(f"Database '{new_database_name}' created successfully.")
finally:
    connection.close()

Database 'MADAIR' created successfully.

### Load data

In [4]:
import pandas as pd
df=pd.read_parquet('data/AirData.parquet')
df.head(3)

,Location,Contaminant,Technique,Year,Month,Day,Value,Date,Th,Outlier
0,Pza.deEspaña,Dióxido de Azufre,Fluorescencia ultravioleta,2003,1,1,6.0,2003-01-01,45.150684,False
1,Pza.deEspaña,Dióxido de Azufre,Fluorescencia ultravioleta,2003,2,1,19.0,2003-02-01,45.150684,False
2,Pza.deEspaña,Dióxido de Azufre,Fluorescencia ultravioleta,2003,3,1,15.0,2003-03-01,45.150684,False

### Make a new table on the DB using the DataFrame data

In [5]:
# Create a connection to the MySQL database using SQLAlchemy
connection_string = f'mysql+pymysql://{user}:{password}@{host}:{port}/{new_database_name}'
engine = create_engine(connection_string)

# Write the DataFrame to a MySQL table 
df.to_sql('AirData', con=engine, if_exists='replace', index=False)

# Optional: Close the connection (if needed)
engine.dispose()

### Load data

In [6]:
import pandas as pd
df=pd.read_parquet('data/Anomalies_count.parquet')
df.head(3)

      Location           Contaminant  Year  Month  Anomalies
0  ArturoSoria  Dióxido de Nitrógeno  2001      1          0
1  ArturoSoria  Dióxido de Nitrógeno  2001      2          1
2  ArturoSoria  Dióxido de Nitrógeno  2001      3          0

### Make a new table on the DB using the DataFrame data

In [7]:
# Create a connection to the MySQL database using SQLAlchemy
connection_string = f'mysql+pymysql://{user}:{password}@{host}:{port}/{new_database_name}'
engine = create_engine(connection_string)

# Write the DataFrame to a MySQL table 
df.to_sql('Outliers', con=engine, if_exists='replace', index=False)

# Optional: Close the connection (if needed)
engine.dispose()